module.exports = {
  "/%E5%89%8D%E7%AB%AF%E8%A7%84%E5%88%92/": [
    {
      "text": "前端规划",
      "children": [
        "/前端规划/README.md",
        "/前端规划/前端工作规划.md",
        "/前端规划/2020年总结.md",
        "/前端规划/2021年总结.md",
        "/前端规划/低代码平台.md",
        "/前端规划/低代码平台数据库.md",
        "/前端规划/前端实习招聘总结.md",
        "/前端规划/前端面试关注点.md",
        "/前端规划/前端面试题目(答案).md",
        "/前端规划/招聘流程优化.md",
        "/前端规划/面试题数据库设计.md"
      ]
    }
  ],
  "/%E5%89%8D%E7%AB%AF%E9%A1%B9%E7%9B%AE/": [
    {
      "text": "前端项目",
      "children": [
        "/前端项目/README.md",
        "/前端项目/项目搭建.md",
        "/前端项目/生产环境发布前端页面.md"
      ]
    },
    {
      "text": "App",
      "children": [
        "/前端项目/App/内衣云App入门.md",
        "/前端项目/App/APICloud 代码逻辑梳理.md",
        "/前端项目/App/APICloud 调试简易指南.md",
        "/前端项目/App/APICloud 项目爬坑.md",
        "/前端项目/App/App安卓模拟器调试.md",
        "/前端项目/App/VSCode开发APICloud项目.md",
        "/前端项目/App/uniapp打包.md",
        "/前端项目/App/uniapp打包（安卓、IOS）及发布到蒲公英平台.md",
        "/前端项目/App/内衣云App端开发文档补充.md"
      ]
    },
    {
      "text": "l-ui组件库",
      "children": [
        "/前端项目/l-ui组件库/README.md",
        "/前端项目/l-ui组件库/linkkap-ui table组件介绍.md",
        "/前端项目/l-ui组件库/前端引入iconfont阿里巴巴矢量图标库.md"
      ]
    },
    {
      "text": "人才价值评估系统",
      "children": [
        "/前端项目/人才价值评估系统/antv踩坑.md",
        "/前端项目/人才价值评估系统/npm发布+appworks.md",
        "/前端项目/人才价值评估系统/qiankun微前端接入.md",
        "/前端项目/人才价值评估系统/人才价值评估系统体验账号.md",
        "/前端项目/人才价值评估系统/人才价值评估自动化项目.md",
        "/前端项目/人才价值评估系统/人才评估系统重构总结.md",
        "/前端项目/人才价值评估系统/数据创建流程.md"
      ]
    },
    {
      "text": "小程序+H5",
      "children": [
        "/前端项目/小程序+H5/CRM-小优链服项目.md",
        "/前端项目/小程序+H5/uniapp入门指南.md",
        "/前端项目/小程序+H5/uniapp踩坑.md",
        "/前端项目/小程序+H5/小程序和H5结合的整个开发流程.md",
        "/前端项目/小程序+H5/股链链小程序环境搭建.md"
      ]
    }
  ],
  "/%E6%8A%80%E6%9C%AF%E5%88%86%E4%BA%AB/": [
    {
      "text": "技术分享",
      "children": [
        "/技术分享/README.md",
        "/技术分享/技术分享介绍.md",
        "/技术分享/前端技术培训说明.md"
      ]
    },
    {
      "text": "其他分享",
      "children": [
        "/技术分享/其他分享/CSS 布局.md",
        "/技术分享/其他分享/CSS动画.md",
        "/技术分享/其他分享/HTML+CSS3新特性.md",
        "/技术分享/其他分享/IOS切图与前端切图差异.md",
        "/技术分享/其他分享/JavaScript基础(一).md",
        "/技术分享/其他分享/JavaScript基础(三).md",
        "/技术分享/其他分享/JavaScript基础(二).md",
        "/技术分享/其他分享/PC网页生成PDF方案.md",
        "/技术分享/其他分享/TypeScript基础.md",
        "/技术分享/其他分享/Typescript基础与进阶.md",
        "/技术分享/其他分享/Vue Router.md",
        "/技术分享/其他分享/Vue3新特性.md",
        "/技术分享/其他分享/axios源码浅读与async_await实现原理.md",
        "/技术分享/其他分享/canvas相关技术分享.md",
        "/技术分享/其他分享/console 技巧.md",
        "/技术分享/其他分享/eggjs.md",
        "/技术分享/其他分享/grid 布局.md",
        "/技术分享/其他分享/vue响应式原理.md",
        "/技术分享/其他分享/webpack_babel_eslint_sass_less.md",
        "/技术分享/其他分享/二叉树.md",
        "/技术分享/其他分享/代码安全&网络攻击与防御.md",
        "/技术分享/其他分享/前端工程化（一）.md",
        "/技术分享/其他分享/前端组件化.md",
        "/技术分享/其他分享/单元测试——Jest.md",
        "/技术分享/其他分享/如何做SEO.md",
        "/技术分享/其他分享/数据结构和算法入门.md",
        "/技术分享/其他分享/浏览器渲染.md",
        "/技术分享/其他分享/浏览器知识（一）.md",
        "/技术分享/其他分享/计算机网络知识点.md"
      ]
    },
    {
      "text": "工作相关分享",
      "children": [
        "/技术分享/工作相关分享/PC网页生成PDF方案.md",
        "/技术分享/工作相关分享/uni-app框架实践运用.md",
        "/技术分享/工作相关分享/webpack实现模块化.md",
        "/技术分享/工作相关分享/webpack构建多页应用.md",
        "/技术分享/工作相关分享/低代码平台-可视化搭建项目.md",
        "/技术分享/工作相关分享/前端实习招聘总结.md",
        "/技术分享/工作相关分享/前端性能优化.md",
        "/技术分享/工作相关分享/微前端+qiankun介绍.md",
        "/技术分享/工作相关分享/性能优化.md",
        "/技术分享/工作相关分享/数据库原理与流.md",
        "/技术分享/工作相关分享/移动端 1px 问题解决方案.md",
        "/技术分享/工作相关分享/设计store的用法.md",
        "/技术分享/工作相关分享/问卷系统的设计和框架.md"
      ]
    }
  ],
  "/%E6%96%B0%E4%BA%BA%E5%85%A5%E9%97%A8/": [
    {
      "text": "新人入门",
      "children": [
        "/新人入门/README.md",
        "/新人入门/新员工指南.md",
        "/新人入门/新员工指南（前端实习）.md",
        "/新人入门/日报汇报格式.md",
        "/新人入门/周报汇报格式.md",
        "/新人入门/公司工具介绍.md",
        "/新人入门/前端知识体系整理.md",
        "/新人入门/学会拒绝.md",
        "/新人入门/开发自查汇总.md",
        "/新人入门/验收规范.md",
        "/新人入门/技术团队介绍.md"
      ]
    },
    {
      "text": "新人培训",
      "children": [
        "/新人入门/新人培训/一对一导师说明.md",
        "/新人入门/新人培训/第一周的前端培训.md",
        "/新人入门/新人培训/第二周的前端培训.md",
        "/新人入门/新人培训/第三周的前端培训.md",
        "/新人入门/新人培训/第四周的前端培训.md",
        "/新人入门/新人培训/第五周的前端培训.md",
        "/新人入门/新人培训/第六周的前端培训.md",
        "/新人入门/新人培训/第七周的前端培训.md",
        "/新人入门/新人培训/第八周的前端培训.md",
        "/新人入门/新人培训/第九周的前端培训.md",
        "/新人入门/新人培训/第十周的前端培训.md"
      ]
    },
    {
      "text": "其他补充知识",
      "children": [
        "/新人入门/新人培训/其他补充知识/Git的基本使用.md",
        "/新人入门/新人培训/其他补充知识/babel 文档.md",
        "/新人入门/新人培训/其他补充知识/eslint 文档.md",
        "/新人入门/新人培训/其他补充知识/移动端布局.md"
      ]
    },
    {
      "text": "新人测试",
      "children": [
        "/新人入门/新人测试/梁天誉-金色摇篮项目总结.md",
        "/新人入门/新人测试/金色摇篮项目入门文档.md"
      ]
    }
  ],
  "/%E7%BC%96%E7%A0%81%E8%A7%84%E8%8C%83/": [
    {
      "text": "编码规范",
      "children": [
        "/编码规范/README.md",
        "/编码规范/前端规范文档.md",
        "/编码规范/ESlint规范.md",
        "/编码规范/nodejs框架文档.md",
        "/编码规范/移动端项目结构.md"
      ]
    },
    {
      "text": "代码管理",
      "children": [
        "/编码规范/代码管理/代码分支.md",
        "/编码规范/代码管理/代码仓库管理.md",
        "/编码规范/代码管理/版本规范.md"
      ]
    }
  ],
  "/%E9%AB%98%E7%BA%A7%E9%9D%A2%E8%AF%95/": [
    {
      "text": "高级面试",
      "children": [
        "/高级面试/README.md",
        "/高级面试/自我介绍.md",
        "/高级面试/简历.md",
        "/高级面试/HTML+CSS知识.md",
        "/高级面试/JavaScript基础.md",
        "/高级面试/JavaScript进阶.md",
        "/高级面试/数据结构.md",
        "/高级面试/算法.md",
        "/高级面试/设计模式.md",
        "/高级面试/前端热门技术.md",
        "/高级面试/软技能.md"
      ]
    }
  ]
}